In [9]:
import pandas as pd
import numpy as np

1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
2. cd into your exercises folder for this module and run echo env.py >> .gitignore
3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [3]:
get_db_url = 'mysql+pymysql://ursula_2340:9CEmU2uxNTVsM0p5iDh2jYLpFovq2wbN@data.codeup.com/employees'
get_db_url

'mysql+pymysql://ursula_2340:9CEmU2uxNTVsM0p5iDh2jYLpFovq2wbN@data.codeup.com/employees'

5. Once you have successfully run a query:

In [4]:
import env

In [5]:
env.host

'data.codeup.com'

In [6]:
env.user

'ursula_2340'

In [7]:
env.password

'9CEmU2uxNTVsM0p5iDh2jYLpFovq2wbN'

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

OperationalErrors

In [16]:
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

In [17]:
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [27]:
employees = pd.read_sql('select * from employees limit 5', url)

6. Read the employees and titles tables into two separate DataFrames.

In [21]:
pd.read_sql('select * from titles limit 5', url)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [30]:
title = pd.read_sql('select * from titles limit 5', url)

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [29]:
employees.shape

(5, 6)

In [31]:
title.shape

(5, 4)

8. Display the summary statistics for each DataFrame.

In [32]:
employees.describe()

             emp_no
count      5.000000
mean   10003.000000
std        1.581139
min    10001.000000
25%    10002.000000
50%    10003.000000
75%    10004.000000
max    10005.000000

In [34]:
title.describe()

            emp_no
count      5.00000
mean   10002.80000
std        1.30384
min    10001.00000
25%    10002.00000
50%    10003.00000
75%    10004.00000
max    10004.00000

9. How many unique titles are in the titles DataFrame?

In [37]:
title.nunique()

emp_no       4
title        3
from_date    5
to_date      2
dtype: int64

10. What is the oldest date in the to_date column?

In [38]:
title['to_date'].min()

datetime.date(1995, 12, 1)

In [39]:
title.min()

emp_no            10001
title          Engineer
from_date    1986-06-26
to_date      1995-12-01
dtype: object

11. What is the most recent date in the to_date column?

In [40]:
title['to_date'].max

<bound method NDFrame._add_numeric_operations.<locals>.max of 0    9999-01-01
1    9999-01-01
2    9999-01-01
3    1995-12-01
4    9999-01-01
Name: to_date, dtype: object>

In [44]:
title.max

<bound method NDFrame._add_numeric_operations.<locals>.max of    emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01>